[
  {
    "name": "Jollof Rice",
    "ingredients": [
      "3 cups Jasmine rice",
      "2 tins tomato paste (156ml each)",
      "2 red onions",
      "5 crimson peppers or 2 large shepherd peppers",
      "1 garlic clove",
      "2 scotch bonnets (optional)",
      "2½ cups chicken or beef broth",
      "Salt",
      "2 bouillon cubes",
      "1 tablespoon curry powder",
      "1 teaspoon black pepper",
      "4 bay leaves",
      "⅓ cup vegetable oil"
    ],
    "instructions": "Rinse 3 cups of Jasmine rice until the water runs clear and set aside. Heat ⅓ cup of vegetable oil in a pot and sauté 1 diced red onion until lightly browned. Add 2 tins of tomato paste and fry for about 10 minutes until the color brightens. Blend 5 crimson peppers or 2 large shepherd peppers, 1 red onion, 1 garlic clove, and 2 optional scotch bonnets into a smooth mixture, then add to the pot. Cook for 15 minutes, stirring occasionally. Add 1 tablespoon of curry powder, 1 teaspoon of black pepper, 2 bouillon cubes, and salt to taste. Pour in 2½ cups of chicken or beef broth and bring to a boil. Add the rinsed rice to the pot, stir well to coat with the sauce, and add 4 bay leaves. Cover tightly. Reduce heat to low and cook for about 45 minutes, allowing the rice to steam. Fluff the rice with a wooden spoon before serving.",
    "country": "GH",
    "image_url": "https://grandbaby-cakes.com/wp-content/uploads/2023/04/jollof-rice-recipe-23.jpg"
  },
  {
    "name": "Fufu and Light Soup",
    "ingredients": [
      "Cassava",
      "Unripe plantains",
      "Goat meat",
      "Goat tripe",
      "Dry fish (catfish or any dry fish of choice)",
      "Tomatoes",
      "Red bell peppers",
      "Scotch bonnets",
      "Onion",
      "Carrots",
      "Ginger",
      "Garlic",
      "Mackerel fish",
      "Lima beans",
      "Dry shrimp",
      "Okra",
      "Tomato paste",
      "Thai Eggplant",
      "Baby Eggplant",
      "Aidan fruit",
      "Bay leaves",
      "Rosemary",
      "Cloves",
      "Selim pepper",
      "Calabash nutmeg",
      "Salt",
      "Shrimp bouillon (optional)",
      "Water",
      "Fresh grated ginger",
      "Ground aniseed",
      "No-salt seasoning"
    ],
    "instructions": "To prepare Fufu, pound cassava and unripe plantains together into a paste, molding into a ball shape. If using processed fufu, follow package instructions. For Light Soup: Season goat meat (and tripe) with fresh grated ginger, crushed garlic, ground aniseed, no-salt seasoning, dried red chili pepper, salt, bay leaves, and chopped onion. Add water and simmer. Separately, boil tomatoes, onion, and chili peppers until soft, then blend into a smooth mixture. Strain pepper mix back into the meats. Add remaining ingredients, including boiled lima beans, baby eggplant, dry fish and spices (rosemary, cloves, selim pepper, calabash nutmeg). Blend baby eggplants, dry shrimp, and cloves until smooth, and add to soup. Adjust seasoning and salt to taste. Serve the light soup with the fufu.",
    "country": "GH",
    "image_url": "https://cdn-images-1.medium.com/max/726/1*XDjyQ6dBVMdybEySuQlHGw.jpeg"
  },
  {
    "name": "Ghanaian Banku and Tilapia",
    "ingredients": {
      "banku": [
        "2 cups fermented corn dough",
        "1 cup cassava dough",
        "3 cups water",
        "Salt to taste"
      ],
      "grilled_tilapia": [
        "2 whole tilapia fish, cleaned and scaled",
        "2 tablespoons vegetable oil",
        "Salt and pepper to taste",
        "1 tablespoon ground ginger",
        "1 tablespoon ground garlic",
        "Fresh herbs (optional, for garnish)"
      ],
      "pepper_sauce": [
        "2 tomatoes",
        "1 onion",
        "2 scotch bonnets (or to taste)",
        "Salt to taste"
      ]
    },
    "instructions": "In a pot, combine fermented corn dough and cassava dough with water; stir to form a thick porridge. Cook on medium heat for about 10 minutes while stirring continuously. Poke holes in the mixture, cover, and cook on low heat for another 10 minutes until smooth. For tilapia, rub with oil, salt, pepper, ginger, and garlic; grill for about 5-7 minutes per side until cooked. Blend tomatoes, onion, and scotch bonnets for sauce; simmer for about 10 minutes. Serve banku with grilled tilapia and drizzle with pepper sauce.",
    "country": "GH",
    "image_url": "https://www.primenewsghana.com/images/banku_1.jpg"
  },
  {
    "name": "Ghanaian Kelewele",
    "ingredients": [
      "Plantains",
      "Ginger",
      "Garlic",
      "Chili pepper",
      "Onion",
      "Salt",
      "Oil"
    ],
    "instructions": "Peel and slice plantains. Blend ginger, garlic, chili pepper, and onion into a smooth paste. Mix the plantain slices with the paste and salt. Heat oil in a pan, then fry the plantains until golden and crispy.",
    "country": "GH",
    "image_url": "https://www.theduchezkitchen.com/wp-content/uploads/2023/05/plantain-recipes-18-scaled.jpg"
  },

  {
    "name": "Ghanaian Groundnut Soup",
    "ingredients": [
      "Peanuts (groundnuts)",
      "Chicken or meat",
      "Tomatoes",
      "Onion",
      "Garlic",
      "Ginger",
      "Tomato paste",
      "Pepper",
      "Salt",
      "Water",
      "Palm oil or vegetable oil"
    ],
    "instructions": "Roast and blend peanuts into a smooth paste. In a pot, heat oil and sauté chopped onions, garlic, and ginger. Add blended tomatoes, tomato paste, and pepper, then cook until thickened. Add chicken or meat, season with salt, and let it simmer. Mix the peanut paste with water until smooth, then pour it into the pot. Stir well and let it cook on low heat until the soup thickens and oil rises to the top. Serve hot with rice balls, fufu, or banku.",
    "country": "GH",
    "image_url": "https://i0.wp.com/travelandmunchies.com/wp-content/uploads/2022/12/IMG_0634.jpg?w=640&ssl=1"
  },
  {
    "name": "Beans and Plantain",
    "ingredients": [
      "Black-eyed peas (beans)",
      "Ripe plantains",
      "Onion",
      "Palm oil",
      "Salt",
      "Pepper",
      "Water"
    ],
    "instructions": "Soak beans in water for a few hours, then boil until soft. In a separate pan, heat palm oil and sauté chopped onions and pepper. Add the cooked beans, season with salt, and stir well. Peel and slice plantains, then fry in hot oil until golden brown. Serve the beans with fried plantains.",
    "country": "GH",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBjzPqGBhlg46BJm6oXKu7TAl6TPOuB9_ABg&s"
  },
  {
    "name": "Waakye",
    "ingredients": [
      "Rice",
      "Black-eyed peas (beans)",
      "Waakye leaves",
      "Salt",
      "Water"
    ],
    "instructions": "Rinse beans and boil with waakye leaves until the beans are soft. Add washed rice, salt, and more water if needed. Cook until the rice is tender and absorbs the color from the waakye leaves. Remove the leaves and serve hot with stew, shito, fried plantains, or boiled eggs.",
    "country": "GH",
    "image_url": "https://static1.squarespace.com/static/657ad44f5e4eac45c72d85f2/65a2e6b631f24e5266afe398/65a2f26d3f9cce64e7e9824c/1708124473662/WhatsApp+Image+2024-02-15+at+3.12.04+PM.jpeg?format=1500w"
  },

  {
    "name": "Kenkey",
    "ingredients": ["Cornmeal", "Water", "Salt", "Corn husks or banana leaves"],
    "instructions": "Mix cornmeal with water to form a dough, then let it ferment for 2-3 days. Divide the dough into two parts; cook one part in a pot while stirring continuously until thick. Mix the cooked and uncooked dough together, then shape into balls. Wrap each ball in corn husks or banana leaves. Steam in a pot with water for several hours until firm. Serve with pepper sauce, fish, or soup.",
    "country": "GH",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Kenkey_and_ground_pepper_with_sardine.jpg/640px-Kenkey_and_ground_pepper_with_sardine.jpg"
  },
  {
    "name": "Tuo Zaafi",
    "ingredients": ["Maize flour", "Cassava flour", "Water"],
    "instructions": "Boil water in a pot. Gradually add maize flour while stirring continuously to form a smooth paste. Let it cook for a few minutes, then add cassava flour and mix thoroughly until thick and stretchy. Continue stirring to prevent lumps. Once well-cooked and smooth, shape into balls and serve hot with soup or stew.",
    "country": "GH",
    "image_url": "https://i0.wp.com/www.gbcghanaonline.com/wp-content/uploads/2022/03/Tuo-Zaafi.jpg?fit=750%2C938&ssl=1"
  },

  {
    "name": "Apapransa",
    "ingredients": [
      "Cornmeal",
      "Peanut paste",
      "Palm oil",
      "Onion",
      "Tomatoes",
      "Dried fish or meat",
      "Salt",
      "Pepper",
      "Water"
    ],
    "instructions": "Heat palm oil in a pot and sauté chopped onions. Add blended tomatoes, pepper, and dried fish or meat, then cook until well combined. Stir in peanut paste and water, letting it simmer. Gradually add cornmeal while stirring continuously to prevent lumps. Cook while stirring until thickened. Serve hot.",
    "country": "GH",
    "image_url": "https://amayneles.wordpress.com/wp-content/uploads/2019/09/67345361_163515284772090_4407751266697070312_n5640247935263617209.jpg"
  },
  {
    "name": "Kontomire Stew",
    "ingredients": [
      "Cocoyam leaves (kontomire) or spinach",
      "Palm oil",
      "Tomatoes",
      "Onion",
      "Garlic",
      "Pepper",
      "Tomato paste",
      "Dried fish or meat",
      "Salt",
      "Egusi (optional)"
    ],
    "instructions": "Wash and chop cocoyam leaves. Heat palm oil in a pot and sauté chopped onions, garlic, and pepper. Add blended tomatoes and tomato paste, then cook until thick. Add dried fish or meat and season with salt. Stir in the chopped leaves and let it simmer until tender. Optionally, add ground egusi for thickness. Serve hot with yam, plantains, or rice.",
    "country": "GH",
    "image_url": "https://deedewfoods.com/wp-content/uploads/2024/06/kontomire-e1733215829617.jpg"
  },
  {
    "name": "Omo Tuo",
    "ingredients": ["Rice", "Water", "Salt"],
    "instructions": "Wash rice and cook in a pot with water until very soft and sticky. Add salt to taste. Mash and stir the rice until smooth. Shape into small balls while warm. Serve hot with groundnut soup, palm nut soup, or light soup.",
    "country": "GH",
    "image_url": "https://i0.wp.com/travelandmunchies.com/wp-content/uploads/2022/11/IMG_9895.jpg?fit=%2C&ssl=1"
  },
  {
    "name": "Ghanaian Akple",
    "ingredients": ["Corn flour", "Water", "Salt"],
    "instructions": "Boil water in a pot and add salt. Gradually add corn flour while stirring continuously to prevent lumps. Stir and knead until the mixture thickens and becomes smooth. Continue cooking while stirring until firm and stretchy. Shape into balls and serve hot with okra soup or pepper sauce.",
    "country": "GH",
    "image_url": "https://homesweet1.home.blog/wp-content/uploads/2020/03/akple-2.jpg"
  },
  {
    "name": "Aboboi",
    "ingredients": [
      "Bambara beans",
      "Onion",
      "Salt",
      "Palm oil",
      "Pepper",
      "Water"
    ],
    "instructions": "Soak Bambara beans overnight, then boil in water until soft. In a separate pan, heat palm oil and sauté chopped onions and pepper. Add the cooked beans, season with salt, and stir well. Simmer for a few minutes and serve hot with fried plantains or kenkey.",
    "country": "GH",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcROBA3hM2wtRStAkumuzOreLz3hf98vk_5zQQ&s"
  },
  {
    "name": "Tatale",
    "ingredients": [
      "Ripe plantains",
      "Onion",
      "Ginger",
      "Pepper",
      "Flour",
      "Salt",
      "Palm oil"
    ],
    "instructions": "Peel and mash ripe plantains in a bowl. Blend onion, ginger, and pepper into a smooth paste, then mix with the mashed plantains. Add flour and salt, stirring until well combined. Heat palm oil in a pan and fry spoonfuls of the mixture until golden brown on both sides. Serve hot with Bambara beans (aboboi) or as a snack.",
    "country": "GH",
    "image_url": "https://live.staticflickr.com/65535/50577883078_a85dbe2cd2_o.jpg"
  },
  {
    "name": "Fried Yam",
    "ingredients": ["Yam", "Salt", "Water", "Oil"],
    "instructions": "Peel and cut yam into thick slices or sticks. Rinse in water and sprinkle with salt. Heat oil in a pan and deep-fry the yam until golden brown and crispy. Remove and drain excess oil. Serve hot with pepper sauce, shito, or fried fish.",
    "country": "GH",
    "image_url": "https://oxygen-envgroupghana.com/wp-content/uploads/2023/02/YAM.jpg"
  },
  {
    "name": "Koko",
    "ingredients": ["Corn flour", "Water", "Ginger", "Cloves", "Sugar", "Salt"],
    "instructions": "Mix corn flour with water to form a smooth paste. Blend ginger and cloves, then add to the mixture. Boil water in a pot and gradually pour in the corn mixture while stirring continuously to prevent lumps. Cook until thick and smooth. Add sugar and salt to taste. Serve hot with bread or koose.",
    "country": "GH",
    "image_url": "https://metemgee.com/wp-content/uploads/2021/02/Cornmeal-Porridge-500x500.jpg"
  },
  {
    "name": "Mpotompoto",
    "ingredients": [
      "Yam",
      "Onion",
      "Tomatoes",
      "Palm oil",
      "Garlic",
      "Pepper",
      "Salt",
      "Dried fish or meat",
      "Water"
    ],
    "instructions": "Peel and cut yam into small chunks. Heat palm oil in a pot and sauté chopped onions, garlic, and pepper. Add blended tomatoes and cook until thickened. Add dried fish or meat, season with salt, and pour in water. Add yam chunks and let it simmer until soft. Mash some of the yam to thicken the mixture while stirring. Serve hot.",
    "country": "GH",
    "image_url": "https://biscuitsandladles.com/wp-content/uploads/2017/03/mpotopoto1-1.jpg"
  },

  {
    "name": "Light Soup",
    "ingredients": [
      "Chicken, goat meat, or fish",
      "Tomatoes",
      "Onion",
      "Garlic",
      "Ginger",
      "Pepper",
      "Tomato paste",
      "Salt",
      "Water"
    ],
    "instructions": "Wash and season meat or fish with salt, garlic, and ginger. In a pot, boil the meat with chopped onions until tender. Blend tomatoes, onions, and pepper into a smooth mixture. Add the blended mixture and tomato paste to the pot, then pour in water to adjust the consistency. Let it simmer until the soup is well-cooked and flavorful. Serve hot with fufu, rice, or omo tuo.",
    "country": "GH",
    "image_url": "https://aliyahsrecipesandtips.com/wp-content/uploads/2020/04/Fish-pepper-soup.jpg"
  },
  {
    "name": "Palm Nut Soup",
    "ingredients": [
      "Palm nuts",
      "Chicken, goat meat, or fish",
      "Tomatoes",
      "Onion",
      "Garlic",
      "Ginger",
      "Pepper",
      "Tomato paste",
      "Salt",
      "Water"
    ],
    "instructions": "Boil palm nuts until soft, then pound and extract the juice. In a pot, season and boil meat or fish with chopped onions, garlic, and ginger until tender. Blend tomatoes, onions, and pepper, then add to the pot with tomato paste. Pour in the extracted palm nut juice and stir well. Let it simmer until the soup thickens and oil rises to the top. Serve hot with fufu, rice, or omo tuo.",
    "country": "GH",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSgee3UGrWfKsK97ZNLq3z0PVGCyEPTHKDeuw&s"
  },
  {
    "name": "Agushie Stew",
    "ingredients": [
      "Egusi (melon seeds)",
      "Tomatoes",
      "Onion",
      "Garlic",
      "Ginger",
      "Pepper",
      "Palm oil",
      "Dried fish or meat",
      "Salt",
      "Water"
    ],
    "instructions": "Blend egusi with a little water to form a smooth paste. Heat palm oil in a pot and sauté chopped onions, garlic, and ginger. Add blended tomatoes and pepper, then cook until thick. Stir in dried fish or meat and season with salt. Add spoonfuls of the egusi paste, allowing it to cook without stirring at first. Once set, gently mix and let it simmer until well combined. Serve hot with yam, rice, or plantains.",
    "country": "GH",
    "image_url": "https://gingerandseasalt.com/wp-content/uploads/2022/05/agushi-egusi-stew.jpg"
  },
  {
    "name": "Akyeke",
    "ingredients": [
      "Cassava couscous",
      "Salt",
      "Water",
      "Palm oil",
      "Pepper",
      "Onion",
      "Tomatoes",
      "Fried fish"
    ],
    "instructions": "Steam cassava couscous with a little water and salt until soft and fluffy. Drizzle with palm oil and mix well. Serve with sliced onions, tomatoes, pepper sauce, and fried fish.",
    "country": "GH",
    "image_url": "https://thespectatoronline.com/wp-content/uploads/2024/10/Akyeke-2.jpg"
  },
  {
    "name": "Ofam",
    "ingredients": [
      "Ripe plantains",
      "Onion",
      "Ginger",
      "Pepper",
      "Flour",
      "Sugar",
      "Nutmeg",
      "Salt",
      "Palm oil"
    ],
    "instructions": "Peel and mash ripe plantains in a bowl. Blend onion, ginger, and pepper into a smooth paste, then mix with the mashed plantains. Add flour, sugar, nutmeg, and salt, stirring until well combined. Grease a baking pan with palm oil, pour in the mixture, and bake at a moderate temperature until golden brown. Serve warm as a snack or side dish.",
    "country": "GH",
    "image_url": "https://aftradvillagekitchen.co.uk/wp-content/uploads/2020/05/IMG_2726-340x220-1.jpg"
  },

  {
    "name": "Garden Egg Stew",
    "ingredients": [
      "Garden eggs (eggplants)",
      "Tomatoes",
      "Onion",
      "Garlic",
      "Ginger",
      "Pepper",
      "Palm oil",
      "Dried fish or meat",
      "Salt"
    ],
    "instructions": "Boil garden eggs until soft, then peel and mash them. Heat palm oil in a pot and sauté chopped onions, garlic, and ginger. Add blended tomatoes and pepper, then cook until thick. Stir in dried fish or meat and season with salt. Add the mashed garden eggs and mix well. Simmer for a few minutes and serve hot with yam, rice, or plantains.",
    "country": "GH",
    "image_url": "https://i.ytimg.com/vi/ggyEtzPkrFs/maxresdefault.jpg"
  },
  {
    "name": "Akotonshi (Stuffed Crabs)",
    "ingredients": [
      "Crab meat",
      "Onion",
      "Tomatoes",
      "Garlic",
      "Ginger",
      "Pepper",
      "Breadcrumbs",
      "Egg",
      "Palm oil",
      "Salt",
      "Nutmeg"
    ],
    "instructions": "Heat palm oil in a pan and sauté chopped onions, garlic, and ginger. Add blended tomatoes and pepper, then cook until thick. Stir in crab meat, season with salt and nutmeg, and mix well. Remove from heat and combine with breadcrumbs and a beaten egg to bind the mixture. Stuff the mixture into cleaned crab shells and bake until golden brown. Serve hot as an appetizer or side dish.",
    "country": "GH",
    "image_url": "https://fafagilbert.com/wp-content/uploads/2018/08/aca141ff-576a-42d0-b773-7c832aba16c3.png?w=1200"
  },
  {
    "name": "Bambara Beans Porridge",
    "ingredients": ["Bambara beans", "Coconut milk", "Sugar", "Salt", "Water"],
    "instructions": "Soak Bambara beans overnight, then boil in water until soft. Add coconut milk, sugar, and a pinch of salt, stirring well. Let it simmer until thick and creamy. Serve warm as a snack or breakfast dish.",
    "country": "GH",
    "image_url": "https://travelandmunchies.com/wp-content/uploads/2022/11/IMG_1172.jpeg"
  },

  {
    "name": "Abolo",
    "ingredients": [
      "Corn dough",
      "Sugar",
      "Yeast",
      "Water",
      "Salt",
      "Banana leaves"
    ],
    "instructions": "Mix corn dough with sugar, yeast, salt, and water to form a smooth batter. Let it ferment for a few hours until it rises. Pour the mixture onto banana leaves and steam until firm and cooked through. Serve warm with fried fish or pepper sauce.",
    "country": "GH",
    "image_url": "https://somethingghanary.wordpress.com/wp-content/uploads/2012/09/abolothin.jpg"
  },
  {
    "name": "Asaana",
    "ingredients": ["Corn", "Sugar", "Water"],
    "instructions": "Soak dried corn overnight, then boil until soft. Strain the liquid and let it ferment slightly. In a separate pan, caramelize sugar until golden brown, then add the fermented corn water. Stir well and let it simmer. Serve chilled as a refreshing drink.",
    "country": "GH",
    "image_url": "https://kentetv.com/wp-content/uploads/2023/10/66613887_160760958399833_2417855890487542251_n-e1697134693953.webp"
  },
  {
    "name": "Ghanaian Sobolo",
    "ingredients": [
      "Hibiscus leaves",
      "Ginger",
      "Cloves",
      "Pineapple",
      "Sugar",
      "Water"
    ],
    "instructions": "Boil hibiscus leaves in water until the color is extracted. Blend ginger, cloves, and pineapple, then strain and add to the hibiscus water. Add sugar to taste and stir well. Let it cool, then refrigerate. Serve chilled as a refreshing drink.",
    "country": "GH",
    "image_url": "https://www.coupons.com.gh/blog/assets/images/sobolo-drink.jpg"
  }
]
